{"data":{"markdownRemark":{"id":"4d5c98f0-10a1-5e55-a44e-3da1104bce2e","html":"<p>As a teen, I had my first social media account opened when I was like 14. Almost all my classmates had it opened before that age. My generation just takes it for granted.</p>\n<p>But when you think about <strong>traditional human communication</strong>, it’s <strong>peer to peer</strong> and <strong>ephemeral</strong>. We talk to the person or group we want to talk to, they reply, and that’s it.</p>\n<p>Then the Internet came along, and people started communicating with each other using <strong>aliases</strong>. Back then people used services like <strong>mailing lists</strong> and <strong>IRC</strong>, which were <strong>federated</strong>.</p>\n<p>But with the Internet going mainstream, <strong>social media started</strong> appearing. People started using their <strong>real names</strong>. And these social media companies had to retain users and think about ways of monetizing them.</p>\n<p>No more federated. <strong>Everything became centralized</strong>.</p>\n<p>There are quite a few problems with centralized social networks:</p>\n<ul>\n<li>\n<p><strong>Network dependent</strong>. You cannot add a Google+ friend if you are in Facebook. Or I cannot redirect all my Facebook Messenger messages to another platform. I am locked in forever.</p>\n</li>\n<li>\n<p><strong>Your data is in the hands of a third party</strong>. Imagine talking to your girlfriend. Now imagine talking to your girlfriend with a random group of people listening. That’s what we’re doing right now.</p>\n</li>\n<li>\n<p><strong>Data remains forever accessible to the network owner</strong>. You think you can delete something in a centralized service? Everything that you upload to servers you don’t control (the so called <em>cloud</em>), you cannot have a proof that your data has been deleted.</p>\n</li>\n<li>\n<p><strong>Surveillance everywhere</strong>. If something can be under surveillance, it will. Governments like control. They will say it’s terrosism, a tsunami, or cats taking over the world. It doesn’t matter. When sharing data with a company linked to governments, you cannot assure your data will not end up in their hands.</p>\n</li>\n<li>\n<p><strong>Censorship</strong>. A centralized entity takes decisions for you. What should you see or not? What can you post or not? And taking decisions for a large group of people has <a href=\"http://www.dictionary.com/browse/dictator\">a clear definition</a>.</p>\n</li>\n<li>\n<p><strong>Manipulation</strong>: Which news should you see first? Which friends matter the most for you? This can go to the creepiest levels. How do you want to feel about your friends? How are you feeling now and what would make you feel better? That’s happening right now, because giving people what they want is what drives user retention.</p>\n</li>\n<li>\n<p><strong>No freedom of expression</strong>. You don’t say what you really want to say if you are being constantly monitored. Everything you say can be used against you.</p>\n</li>\n</ul>\n<blockquote>\n<p>Saying you don’t care about privacy because you have nothing to hide is like saying you don’t care about free speech because you have nothing to say.<br><br>\nEdward Snowden</p>\n</blockquote>\n<h2 id=\"dont-be-owned-own-your-data\"><a href=\"#dont-be-owned-own-your-data\" aria-label=\"dont be owned own your data permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Don’t be owned, own your data</h2>\n<p>I feel positive about the decentralized alternatives to social networking that are appearing now. The one I like the most is <a href=\"http://akasha.world\">Akasha</a>. It’s super early but I couldn’t be more excited of being an early tester.</p>\n<p>It uses the <a href=\"https://ethereum.org/\">Ethereum</a> blockchain, and creates a social profile that you fully own.</p>\n<p>Since it is a set of <strong>contracts in a decentralized ledger</strong>, there’s no dictator deciding how you should use it. It is <strong>not a walled garden</strong>. It is <strong>censorship-resistant</strong>. And your identity is just a key pair, so it is easy to add <strong>end to end cryptography</strong> to all the social interactions.</p>\n<p>This is not a matter of which product has the best features, or which product has the largest user network. It is a matter of principles.</p>\n<p>It is just an answer to a simple question.</p>\n<p><strong>Do you want to live in a world in which a central party owns every single human relationship?</strong></p>","fields":{"slug":"/human-relationships-have-been-owned-1ff27da0a63","tagSlugs":null},"frontmatter":{"date":"2016-12-30","description":"","tags":null,"title":"Human relationships have been owned","image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/human-relationships-have-been-owned-1ff27da0a63"}}