{"data":{"markdownRemark":{"id":"79bc1e29-e3be-5cb8-af1b-8d759ea05d7c","html":"<p>Traveling gets you out of your routine. <strong>Investing into your routine has a high return on investment</strong>. That’s because you repeat it almost every day, so any insignificant change that makes it better will compound over time.</p>\n<p>But when traveling that doesn’t apply. Discovering a new cool coffee to work from will be <strong>useful for the few days you are there, but effects won’t compound</strong>.</p>\n<p>Keep in mind that I’m talking about short trips. Staying for weeks or months is different, since you have a chance of setting up a routine and getting into the flow.</p>\n<p>But in short trips, the <strong>investments you make into building a routine will be lost</strong>.</p>\n<p>So, should I cut off all the travel? Depends on what you are trying to optimize for.</p>\n<blockquote>\n<p>You can optimize for productivity or creativity, but not both</p>\n</blockquote>\n<p>If you need to be productive, there is no doubt that routine helps. Routine helps avoid distractions and reduce decision fatigue. You can just re-use your past decisions. Rinse and repeat.</p>\n<p>Yet routine doesn’t optimize for creativity.</p>\n<p><strong>Creativity comes from constantly questioning our environment. Routine optimizes for productivity by making us not question our environment.</strong></p>\n<h2 id=\"short-trips\"><a href=\"#short-trips\" aria-label=\"short trips permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Short trips</h2>\n<p>I have found short trips to be useful for:</p>\n<ul>\n<li><strong>Re-charging</strong>: Short-stay trips of just a few days can make you feel more alive. Breaking out of your habits may decrease your productivity. But <strong>when that decrease of productivity starts hurting you, you come back to routine</strong>. Since you are now more energized, you are more productive too.</li>\n<li><strong>Boosting creativity</strong>: Seeing new places, cultures, meeting new people… all that makes our brain create links that we wouldn’t normally create. Said otherwise, <strong>new environments generate more entropy for the brain</strong>. More entropy leads to better creativity.</li>\n</ul>\n<h2 id=\"long-trips\"><a href=\"#long-trips\" aria-label=\"long trips permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Long trips</h2>\n<p>I have found long trips to be useful for:</p>\n<ul>\n<li><strong>Getting to know yourself better</strong>: If you have been in a routine for very long, chances are that you start linking who you are to your routine. While that’s clearly linked, you can be yourself somewhere else. <strong>Detaching from your routine and material environment makes you discover more about yourself</strong>.</li>\n<li><strong>Increasing long-term creativity</strong>: Same as short trips, except that in this case, you feed your brain with <strong>long-lasting entropy</strong>. In a short trip, you can have a couple a-ha moments. In a long trip, you may still have those moments after coming back to your routine. That’s because a long trip enables you to better understand the environment you are visiting. If you spend a couple months somewhere, you stop just being a tourist. You start understanding how this new place works, and you accumulate knowledge about it.</li>\n</ul>\n<h2 id=\"staying-productive-while-traveling\"><a href=\"#staying-productive-while-traveling\" aria-label=\"staying productive while traveling permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Staying productive while traveling</h2>\n<p>Traveling, used carefully, is a powerful tool for remote workers. Yet it can ruin your work if used without control.</p>\n<p>The good news is that you can stay productive even when traveling. The trick is <strong>discipline</strong>.</p>\n<p>And <strong>focus</strong>, which can be derived from discipline. While traveling, there are a lot of distractions.</p>\n<p>If you find yourself getting distracted, lock your time. Lock your calendar with tasks you need to complete. You will be busy for anything else that comes along but that one task you are working on.</p>\n<p>Then you can do the opposite for days in which you want to optimize for creativity. Just leave them totally free, and see where the flow takes you.</p>\n<p>🌴</p>\n<hr>\n<p>You can find more posts about personal productivity in <a href=\"https://blog.luisivan.net/a-series-on-personal-productivity-640397638e8\">my series about it</a></p>","fields":{"slug":"/leveraging-travel","tagSlugs":["/tag/productivity/"]},"frontmatter":{"date":"2019-06-06","description":"Leveraging travel so it helps you be more creative and productive","tags":["Productivity"],"title":"Leveraging travel","image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/leveraging-travel"}}