{"data":{"markdownRemark":{"id":"e7d19b63-9489-589e-976d-530bb5822270","html":"<p>I’ve seen a lot of people crying out to Facebook lately. It is hard to deny that they had <strong>a huge impact on the past US elections</strong>. They are the world’s biggest social media company. And yes, social media is still media, so they are a media company. Just that their media is crowdsourced and not produced by them.</p>\n<p>Fake news is not created by them, but they spread like fire. After all, sometimes fake news is what people want to believe in. <strong>Everyone is happy seeing how their beliefs are publicly supported</strong>.</p>\n<p>Facebook’s incentive is to retain users and engage them as much as possible. So they provide people with the content they want to see. So <strong>Facebook is incentivized to prioritize fake news in the users’ newsfeeds</strong>.</p>\n<p>The thought process for the majority of people so far would be something like:</p>\n<ul>\n<li>\n<p>Facebook serves fake news to their users</p>\n</li>\n<li>\n<p>The massive sharing of fake news influenced the US elections</p>\n</li>\n<li>\n<p>The outcome of the US elections was not favorable</p>\n</li>\n<li>\n<p>So Facebook must drop fake news from their ranking algorithm</p>\n</li>\n</ul>\n<p>Until here, the thought process seems sane. The problem is the next step.</p>\n<h2 id=\"fake-news-detector\"><a href=\"#fake-news-detector\" aria-label=\"fake news detector permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Fake news detector</h2>\n<p>Some say the solution is that Facebook should use a fake news detector and either ban them or alert the user.</p>\n<p>This could be achieved today with common machine learning techniques. This seems pretty sane too. The problem is that <strong>this filtering algorithm is a double-sided sword</strong>.</p>\n<p>Since <strong>it would be run by a central entity, you cannot influence it</strong>. They determine what’s fake and what isn’t. That is an extremely <strong>powerful propaganda tool</strong>. A filter to just remove information or make them think it is plain false.</p>\n<p><strong>Even if they let users customize it</strong> — which nobody would do, <strong>there is no way to prove they are obeying the custom filtering settings</strong>. This is true of any centralized service, since <strong>you cannot see the code that is running on their servers</strong>.</p>\n<p>This inevitably creates a dictatorship. A company that is managing all your social connections, now can determine what is true or not.</p>\n<p>Mainstream media is not always right, but they have the brand. People believe in them without even fact checking. Even some editors don’t fact check. So you could end up with some totally incorrect piece of news that this filter can mark as correct.</p>\n<p>Or the other way around, <strong>a fine piece of news can be marked as fake and mine its credibility forever</strong>.</p>\n<h2 id=\"individuals-should-be-informed\"><a href=\"#individuals-should-be-informed\" aria-label=\"individuals should be informed permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Individuals should be informed</h2>\n<p>Citizens have a vote because they are supposed to be informed about the options.</p>\n<p>If they are not, <strong>that is a problem in democracy, not in some private company</strong>.</p>\n<p>Actually, by giving the power to decide what people should read to an opaque algorithm, we are making the problem worse. It makes this company <strong>take decisions for the voters, thus influencing their decisions</strong>.</p>\n<h2 id=\"facebook-is-a-private-company\"><a href=\"#facebook-is-a-private-company\" aria-label=\"facebook is a private company permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Facebook is a private company</h2>\n<p>We have went through why people defending that Facebook should remove fake news are plain wrong. They are not technical enough to understand the implications of that possible solution.</p>\n<p>Nor they understand how governance works. Facebook is a private company. Seems like <strong>some people believe Facebook is some public service or something</strong>. It is not. They can build the product they want to build. <strong>As a user you don’t have any decision power.</strong></p>\n<p>And that’s fine! <strong>We all agreed to that when signing up and using it</strong>. So, if you don’t like Facebook, why not to stop crying and just leave it?</p>\n<p>New, better social networks are possible. Networks that can solve the fake news problem without falling into a dictatorship.</p>\n<h2 id=\"the-true-solution-to-the-fake-news-problem\"><a href=\"#the-true-solution-to-the-fake-news-problem\" aria-label=\"the true solution to the fake news problem permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>The true solution to the fake news problem</h2>\n<p>So <strong>an algorithm run by a private company in their opaque servers can be useful, but leads to a dictatorship.</strong> And gives unprecedented power to that given company.</p>\n<p>If we believe the solution is an algorithm, we would need it to be:</p>\n<ul>\n<li>\n<p>Open source</p>\n</li>\n<li>\n<p>Fully customizable by the users</p>\n</li>\n<li>\n<p>Its defaults are consensuated among all parties using the network</p>\n</li>\n<li>\n<p>The filtering and flagging are done locally, and thus verifiable and transparent</p>\n</li>\n</ul>\n<p>And this brings us to something like a blockchain-based social network.</p>\n<p>This network would be peer-to-peer. <strong>There is not central company with opaque servers</strong>.</p>\n<p>It would be open source, so you can <strong>review the filtering algorithm you are running</strong>.</p>\n<p>It would have a consensus mechanism so <strong>users can decide what should be the sensible defaults</strong> for the algorithm.</p>\n<p>The incentives here would be:</p>\n<ul>\n<li>\n<p>The network creators want all news to spread, so there’s more content and usage. So their incentives would be for the filtering list to be as minimal as possible. Thus <strong>this disincentivizes censorship</strong></p>\n</li>\n<li>\n<p>The publishers would want to convince users that their content is accurate. They would put in place <strong>easy ways for people to verify the facts</strong></p>\n</li>\n<li>\n<p>The users, for the most part, don’t care and will use the defaults. And they will rarely vote to change them. Yet, <strong>the users that care, will indeed fight for accuracy</strong>. Like how Wikipedia contributors behave</p>\n</li>\n</ul>\n<p>As I said in my <a href=\"https://blog.luisivan.net/human-relationships-have-been-owned-1ff27da0a63#.ra3g1ud4b\">previous post about decentralizing social media</a>, I’m very excited about <a href=\"http://akasha.world\">Akasha</a>. I would love for them to <strong>implement something like this in the future</strong>.</p>\n<p>I can imagine a future where <a href=\"https://steemit.com\">Steem</a> incentivizes the creation of great content, and <a href=\"http://akasha.world\">Akasha</a> incentivizes its consumption. This can lead to meaningful, accurate information to be spread.</p>\n<p>So stop crying out to a private company, and start helping alternatives that actually solve the problem, not make it worse.</p>","fields":{"slug":"/facebook-serving-fake-news-is-not-the-problem-we-should-look-at-88b9f51212dc","tagSlugs":null},"frontmatter":{"date":"2017-01-06","description":"","tags":null,"title":"Facebook serving fake news is not the problem we should look at","image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/facebook-serving-fake-news-is-not-the-problem-we-should-look-at-88b9f51212dc"}}