{"data":{"markdownRemark":{"id":"77ee5174-a650-54bc-a338-2192a23091b4","html":"<p><a href=\"https://district0x.io/\">district0x</a> is a network of decentralized markets and communities. You could think of it as an incentivized, decentralized, modular Craigslist.</p>\n<p>The Internet brought us the ability to trade without intermediaries. Yet we were somehow limited by payments being either through a centralized authority, or cash, which is very location-limited.</p>\n<p><strong>Bitcoin</strong> came along and solved that. Platforms for decentralized markets like <strong>OpenBazaar</strong> emerged.</p>\n<p>But, thanks to tokens, we can now <strong>incentivize smaller communities towards a same goal</strong>. We can create decentralized markets that are optimized towards a given metric. Not just decentralized markets, but markets with network effects. Markets that, for example, <strong>self-curate</strong> themselves by offering the right incentives for people to work for them.</p>\n<p>And that’s just what district0x is working on.</p>\n<p>I couldn’t be more excited to see those markets working. <a href=\"https://ethlance.com/\">Ethlance</a>, <a href=\"https://namebazaar.io/\">Name Bazaar</a>, and <a href=\"https://memefactory.io/\">Meme Factory</a> are some early manifestations of what’s on the pipeline.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/5784/1*W_8vvnaMkkbLu1JY1TJzNw.png\"></p>\n<p>I strongly believe user-focused products are very much needed in the space, and the team does really have a great track record of caring about that.</p>\n<p>They are also building on top of Aragon, which is built on top of Ethereum. This will maximize their impact on the protocols that they are building on top of, as I explained in <a href=\"https://blog.aragon.one/the-emergent-ethereum-stack-cbce1895142f\">The emergent Ethereum stack</a>.</p>\n<p>To help district0x along the way, <strong>I’m proud to serve them as an <a href=\"https://district0x.io/#team\">Advisor</a></strong>. I have known Joe since all this craziness started, and his contributions to the community and to Aragon have been invaluable. They will be the first to try this new blockchain stack model out, and I’m so excited about them.</p>\n<p><em>Note: My advisory role for district0x is purely in a personal capacity</em></p>","fields":{"slug":"/disintermediating-marketplaces-e614e4b63944","tagSlugs":null},"frontmatter":{"date":"2017-07-17","description":"Why I am advising district0x","tags":null,"title":"Disintermediating marketplaces","image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/disintermediating-marketplaces-e614e4b63944"}}