{"data":{"markdownRemark":{"id":"062eff9b-69a8-5e16-ae2f-07cba47ae4f7","html":"<p><em>(I actually wrote this a year ago, but I just found it in my home directory)</em></p>\n<p>I’m so proud of publishing this post. Not because of the post, not even because I’ll share it to the world.</p>\n<p>Just because <strong>it took me time to write it</strong>.</p>\n<p>Quality time, <strong>time spent thinking</strong>. And not thinking about something concrete, but about something really abstract and more important, my ideas and thoughts.</p>\n<p>As I exposed in <a href=\"http://blog.luisivan.net/subconscious-manipulation\">Subconscius Manipulation</a>, nowadays we are being flooded by ideas, and for some of them we don’t even notice and they mix up with our very owns.</p>\n<p>As I said, it is the way it is, and I don’t think it’s easy to change with the educational system we have now.</p>\n<p>However, these thoughts that get pushed into our brains subconsciously, can be removed from it. The only action we need to take is to think.</p>\n<p>Think about them, see if they match with our values and ideas, and if they don’t, delete them.</p>\n<p>The issue is, <strong>thinking requires time</strong>. Quality time.</p>\n<p>And that’s precisely what we don’t have nowadays.</p>\n<p>Think about it. Centuries ago, human beings had more free time than us. Maybe not <em>free time</em>, but time that can be used to think <strong>without distractions</strong>.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/1*La9lu7hjaw6HvwEpxH_rqw.jpeg\"></p>\n<p>For example, being in the subway or biking while going to work could be that kind of time. It’s not free time, but you can abstract yourself there.\nIt could be, except we got <strong>smartphones</strong>. We got <strong>Facebook, Twitter, Instagram…</strong> Sometimes I see myself in there, pulling to refresh and <strong>awaiting for the new stuff to download so I can keep losing time</strong>.</p>\n<p><strong>Thinking takes some effort. Pulling to refresh, doesn’t.</strong></p>\n<p>And the point is, you don’t notice you are actually losing time since it’s considered a social activity. <strong>You are just caring about your friends, right?</strong>\nBut please stop and ask yourself this: <strong>how many times have you opened any social app because you actually cared about a person, and how many times have you opened it because of the good feeling that seeing a feed full of people having fun gives?</strong></p>\n<p>I understand we are all tired. We got jobs, we got things to do. We just wanna go home and relax. Spending the few <em>free time</em> we got not having fun feels wrong.</p>\n<p>I’d like to reference <em>Brave New World</em>, a novel that tells the story of a dystopian society where everybody is constantly and artificially happy.\nIn <em>Brave New World</em>, <strong>everybody spends seven and a half hours working</strong>. Even when the jobs could be fully or partly automated, they’re not, because <strong>their function is to entertain</strong>.</p>\n<p>Then the people spend the rest of the day <strong>having social life, playing games and having sex</strong>. And the moment they don’t feel happy, they take drugs.</p>\n<p>Does it sound familiar at all?</p>\n<p>Nowadays we wake up, and <strong>spend eight hours working or at school/university</strong>. Sounds familiar.</p>\n<p>We have social life, but <strong>I don’t see a lot of discussions about trascendental stuff</strong> going on. Sounds familiar.</p>\n<p><strong>We play silly games on our smartphone</strong> — well, I don’t, I prefer playing sports that keep me healthy — and virtual reality games will get mainstream soon. Sounds familiar.</p>\n<p>And well, having sex… I see couple sex is fastly decreasing in very civilized countries such as Japan — I actually see Japan as a very dystopian country — with prostitution taking its place. In <em>Brave New World</em>, couple relationships didn’t exist and where replaced by orgies and free sex, in a way to <strong>avoid strong emotional relationships from happening</strong>. Sounds familiar.</p>\n<p>Let’s talk about drugs. Alcohol and tabacco are there, but I don’t think they are the real drug. <strong>The real drug right now, that even Aldous Huxley couldn’t imagine, is information</strong>. I hope it was information full of meaning, but it is mostly meaningless. <strong>It is a feed full of people publicly announcing each little thing they do everyday</strong>.</p>\n<p>I love technology. I love innovation. But it is being used for the bad, and this is really scary.</p>\n<p>I try to work on something meaningful.</p>\n<p>I try to talk about important stuff with my friends.</p>\n<p>I try not to be my smartphone’s slave.</p>\n<p>I’m just trying. Nobody said it was easy.</p>\n<p>There’s only one life, and I don’t wanna spend it reading a cold, meaningless feed.</p>\n<p><strong>I wanna build something meaningful.</strong></p>","fields":{"slug":"/distractions-and-dystopia","tagSlugs":null},"frontmatter":{"date":"2015-07-31","description":"","tags":null,"title":"Distractions and dystopia","image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/distractions-and-dystopia"}}